app/Controllers/Login.php

SELECT *
FROM `reservation_pic`
WHERE `email` = 'hoteloka@gin.com'
 LIMIT 1
---
    public function loginActionProvider()
    {
        // get request body
        $body = $this->request->getJSON();

        // get email and password from request body
        $email = $body->email;
        $password = $body->password;

        // check if email and password is empty
        if (empty($email) || empty($password)) {
            // return error response
            return $this->response->setJSON(['error' => 'Email and password are required'])->setStatusCode(400);
        }

        $picModel = new ReservationPICModel();

        $pic = $picModel->where('email', $email)->first();