app/Controllers/Reservations.php

SELECT *
FROM `reservations`
---
    public function index(): string
    {
        $reservationModel = new ReservationModel();
        $reservations = $reservationModel->findAll();