app/Controllers/Reservations.php

SELECT *
FROM `reservations`
SELECT *
FROM `rooms`
WHERE `rooms`.`id` = '1'
---
    public function index(): string
    {
        $reservationModel = new ReservationModel();
        $reservations = $reservationModel->findAll();

        // get room number from roomID for each reservation, and return as new array
        $roomModel = new RoomModel();
        $roomNumbers = [];
        $roomFloors = [];
        $totalPrices = [];
        $guestData = [];

        foreach ($reservations as $reservation) {
            $room = $roomModel->find($reservation['roomID']);
            $roomNumbers[] = $room['roomNumber'];
        }

        // get room floor from roomID for each reservation, and return as new array
        foreach ($reservations as $reservation) {
            $room = $roomModel->find($reservation['roomID']);
            $roomFloors[] = $room['floor'];
        }

        foreach ($reservations as $reservation) {
            $room = $roomModel->find($reservation['roomID']);

SELECT *
FROM `guests`
WHERE `guests`.`id` = '7'
---
        // get guest data from guestID for each reservation, and return as new array
        $guestModel = new GuestModel();
        foreach ($reservations as $reservation) {
            $guest = $guestModel->find($reservation['guestID']);