app/Controllers/Rooms.php

    public function index(): string
    {
        $roomModel = new RoomModel();
        $rooms = $roomModel->findAll();
---
SELECT *
FROM `rooms`

    public function getRooms()
    {
        // Get JWT Bearer Token from request header
        $token = $this->request->getHeaderLine('Authorization');

        // return $this->response->setJSON(['token' => $token])->setStatusCode(200);
        // Verify the token
        $key = getenv("JWT_SECRET");

        try {
            $decoded = JWT::decode($token, new Key($key, "HS256"));
            // Token is valid, you can access user data using $decoded
        } catch (\Exception $e) {
            // Token is invalid, return error response
            return $this->response->setJSON(['error' => 'Unauthorized: Invalid token'])->setStatusCode(401);
        }

        // Create model object
        $roomModel = new RoomModel();

        // Get all rooms
        $rooms = $roomModel->findAll();
---
SELECT *
FROM `rooms`